app/controllers/albums_controller.rb

  def create
    label_params = {:name => params[:new_label]}

    @labels = Label.all
    @label = Label.new(label_params)
    @album = Album.new(album_params)

    # if Label.exists?(:name => params[:new_label])
    #   @label = Label.where(:name => label_params[:name]).first
    #   @album.label_id = @label.id
    # end

    if @label.save(validate: false)
---
INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "new_label"], ["created_at", "2015-11-02 21:34:09.034630"], ["updated_at", "2015-11-02 21:34:09.034630"]]