app/controllers/albums_controller.rb

SELECT  "labels".* FROM "labels"  ORDER BY "labels"."id" ASC LIMIT 1
---
  def new
    @album = Album.new
    @artist = Artist.new
    @label = Label.new
    @labels = Label.all.map{ |l| [ l.name, l.id ] }

SELECT  "labels".* FROM "labels"  ORDER BY "labels"."id" ASC LIMIT 1
SELECT  "labels".* FROM "labels" WHERE "labels"."name" = ?  ORDER BY "labels"."id" ASC LIMIT 1  [["name", "Fueled By Ramen"]]
SELECT  1 AS one FROM "labels" WHERE "labels"."name" = ? LIMIT 1  [["name", "new_label"]]
---
  def create
    label_params = {:name => params[:new_label]}
    artist_params = {:name => params[:artist_name]}

    @labels = Label.all
    @label = Label.new(label_params)
    @artist = Artist.new(artist_params)
    @album = Album.new(album_params)

    if @label.name != ''
      if Label.exists?(:name => label_params[:name])

INSERT INTO "albums" ("title", "artist", "genre", "added", "plays", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Drunk Enough to Dance"], ["artist", ""], ["genre", ""], ["added", "2015-11-02"], ["plays", 0], ["created_at", "2015-11-02 20:52:27.735448"], ["updated_at", "2015-11-02 20:52:27.735448"]]
---
    end

    # TODO Parker: This should be less friggin' ugly and inefficient
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 5]]
---
  def destroy
    @albums = Album.all
    @album = Album.find(params[:id])
    @album.destroy