app/controllers/labels_controller.rb

  def index
    @labels = Label.all
---
SELECT "labels".* FROM "labels"

  def create
    @label = Label.new(label_params)

    respond_to do |format|
      if @label.save
---
INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fueled By Ramen"], ["created_at", "2015-10-31 23:07:55.186765"], ["updated_at", "2015-10-31 23:07:55.186765"]]

  def destroy
    @label.destroy
---
DELETE FROM "labels" WHERE "labels"."id" = ?  [["id", 2]]

    def set_label
      @label = Label.find(params[:id])
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT 1  [["id", 2]]